{ "stories": [{
    "title": "Twitter May Have Just Doomed Humanity by Trolling an Artificial Intelligence Bot",
    "author": "Ryan Faith",
    "content": "Some bright bulb at Microsoft Research had the clever idea of turning a machine learning program loose on Twitter yesterday to learn how humans interact with each other. Humans, predictably, interacted terribly. Within 24 hours, the Twitter bot @TayandYou had turned spectacularly ugly in the way only the internet can turn things ugly, spewing racism and hate at Twitter uses in a series of horrifying tweets. Most of them have already been deleted, perhaps in a bid to ensure that any future artificial intelligence (AI) won't have evidence of what horrible bastards humans were back before AI took over the world. Or maybe Microsoft was simply trying to avoid bad PR. Regardless, there are screenshots. And those future AIs would be right to be pissed about how humankind warped the mind of this poor machine learning program.",
    "image": "https://c1.staticflickr.com/5/4140/4927029572_7d9fa8769c_z.jpg"
  }, {
    "title": "Some Mexicans Celebrated Easter by Burning Effigies of Donald Trump",
    "author": "Tess Owen",
    "content": "On Saturday night in La Merced, a barrio in the southeast corner of Mexico City's historic center, residents gathered in a public square and looked on with delight as a paper mache effigy of Donald Trump exploded and burst into flames. The symbolic destruction of the Donald was part of a traditional Catholic or Orthodox ritual held annually on the Saturday before Easter. Participants have historically burned representations of Judas Iscariot, the biblical embodiment of deceit who betrayed Jesus, but the holiday has evolved over the years, and 'Judas' often takes other forms — like the current frontrunner for the Republican presidential nomination. Leonardo Linares, a fourth generation artisan in Mexico City, specializes in making Judas-like effigies for Easter weekend. His great-grandfather, Pedro Linares, employed over 300 people in the 1950s to make Judases to sell citywide when the tradition was at peak popularity. The number of people burning effigies has since waned, but this year Mexicans rallied around a common enemy: The wispy-haired billionaire who wants to build a giant wall along the southern US border.",
    "image": "http://www.trbimg.com/img-56f7d6f5/turbine/ct-donald-trump-mexico-effigy-20160327"
  }, {
    "title": "Here's How Zero-Tolerance Drug Policies Have Damaged Public Health Worldwide",
    "author": "Sydney Lupkin",
    "content": "Ahead of the first special session of the United Nations General Assembly on global drug policy in nearly two decades health officials from around the world have formed a commission and authored a report to persuade officials to walk back the zero-tolerance policies of the past 50 years, which they say have harmed public health instead of protecting it. The theme of the last special session on drugs in 1998 — 'A drug-free world — we can do it!' — advocated drug eradication and a draconian approach to drug use. In calling for decriminalization of minor drug offenses and increased social and health services for drug users, the 22 members of the Johns Hopkins-Lancet Commission on Public Health and International Drug Policy hope their 54-page report will encourage officials to undo some of that damage when the three-day session begins on April 19. Hailing from a dozen countries, including the United States, Switzerland, Mexico, and Nigeria, the commission's 22 members wrote in the Lancet medical journal that the zero-tolerance stance wasn't based on scientific evidence, and ultimately spurred 'lethal violence, communicable-disease transmission, discrimination, forced displacement, unnecessary physical pain, and the undermining of people's right to health.''It's time for us to rethink our approach to global drug policies, and put scientific evidence and public health at the heart of drug policy discussions,' Dr. Chris Beyrer of the Johns Hopkins Bloomberg School of Public Health, a commission member, said in a statement.",
    "image": "http://beat.drugabuse.com/wp-content/uploads/the-12-worst-drugs-to-get-addict.jpg"
  }, {
    "title": "Canada's First Revenge Porn Convict Gets 90 Days in Jail",
    "author": "Tamara Khandaker",
    "content": "The first test of Canada's revenge porn law has sent a Winnipeg man, who posted naked photos of his ex online after she confessed to cheating on him, to prison for 90 days. The 29-year-old man, whose name hasn't been published in order to protect the identity of the victim, admitted to posting three nude photos of her on Facebook after their year-long relationship came to a bitter end. Judge Carena Roller said while she believed he was remorseful and wouldn't do it again, the sentence 'must have a chilling effect' on others who might consider 'revenge porn' in the future, the Winnipeg Sun reported. Roller also banned the man from using the internet for three years except for work purposes as part of his supervised probation. 'It's trite to say (the accused) won't be the last person to be upset by the breakup of a relationship of infidelity and many will have access to the internet and applications such as Facebook,' she said. The man's lawyer said his client was devastated after he caught his ex-girlfriend cheating on him with a co-worker, posted the photos after getting drunk and high on cocaine, and deleted them 30 minutes later, according to the Sun. He pleaded guilty to publishing and distributing intimate images of his ex without her consent last March, just weeks after the act was made a criminal offence by the formerly governing Conservatives' anti-cyberbullying law, Bill C-13 — a move privacy lawyer David Fraser calls a 'progressive move by a not-so-progressive government.' Roller rejected his request for a conditional penalty that would've kept him out of jail, but has allowed his sentence to be served on weekends, which lets him continue to work full time during the week. While it's unknown how many people saw the photos or if anyone made copies, Crown attorney Nadine Vasas pointed out to the court that 'there was an understanding that these (images) were to remain within the relationship.'",
    "image": "https://0.s3.envato.com/files/3904259/MVI_9430-H264%201080.jpg"
  }]
}
